// pages/hotword/hotword.js
Page({

  /**
   * 页面的初始数据
   */
  data: {
    list: [
      "嘘，别出声，每一个音符都是青春 ——《你若成风》",
      "年纪一大把 我居然听许嵩听得这么开心 ——《你若成风》",
      "你若化成风，我成华晨宇 ——《你若成风》",
      "暗恋初中同桌很久,有次看她在折星星,便问她折给谁？她笑着说要送给喜欢的人.毕业那天,她送给我一个熊状娃娃.我拿着却想：那些星星送给谁了呢？ 随着时间的流逝,我结婚生子.那只小熊我也丢给儿子玩了.后来某天,儿子不小心把熊扯烂,里面满满的全是星星,都掉了出来.我傻傻的看着,泪流满面 ——《当你老了》",
      "当你老了 我也老了 平行而进 平行而尽 ——《当你老了》",
      "叶芝《当你老了》，在柏拉图式的爱恋中，对象终为幻想，而正是幻想，才能辽阔幽远山高水长。此刻你希望谁能记起你的名字，知道你还想着他？——《当你老了》"
    ]
  },

  /**
   * 生命周期函数--监听页面加载
   */
  onLoad: function (options) {

  },

  /**
   * 生命周期函数--监听页面初次渲染完成
   */
  onReady: function () {

  },

  /**
   * 生命周期函数--监听页面显示
   */
  onShow: function () {

  },

  /**
   * 生命周期函数--监听页面隐藏
   */
  onHide: function () {

  },

  /**
   * 生命周期函数--监听页面卸载
   */
  onUnload: function () {

  },

  /**
   * 页面相关事件处理函数--监听用户下拉动作
   */
  onPullDownRefresh: function () {

  },

  /**
   * 页面上拉触底事件的处理函数
   */
  onReachBottom: function () {

  },

  /**
   * 用户点击右上角分享
   */
  onShareAppMessage: function () {

  },

  word1:function(){
    this.setData({
      list: [
        "嘘，别出声，每一个音符都是青春 ——《你若成风》",
        "年纪一大把 我居然听许嵩听得这么开心 ——《你若成风》",
        "你若化成风，我成华晨宇 ——《你若成风》",
        "暗恋初中同桌很久,有次看她在折星星,便问她折给谁？她笑着说要送给喜欢的人.毕业那天,她送给我一个熊状娃娃.我拿着却想：那些星星送给谁了呢？ 随着时间的流逝,我结婚生子.那只小熊我也丢给儿子玩了.后来某天,儿子不小心把熊扯烂,里面满满的全是星星,都掉了出来.我傻傻的看着,泪流满面 ——《当你老了》",
        "当你老了 我也老了 平行而进 平行而尽 ——《当你老了》",
        "叶芝《当你老了》，在柏拉图式的爱恋中，对象终为幻想，而正是幻想，才能辽阔幽远山高水长。此刻你希望谁能记起你的名字，知道你还想着他？——《当你老了》"
      ]
    })
  },

  word2: function () {
    this.setData({
      list: [
        "店里旁边是一对情侣，男孩说分手，女孩镇静地问他，她在交往中的行止他认为哪些是不好的。两个人诚恳地说了很多，我那时甚至感觉他们像是老友。最后握手，互相祝福。女孩说她想要再吃点东西，男孩就先走了。女孩平静地吃甜点，可是她在默默流泪。我跑出店，发现不远处男孩在哭。突然，我感觉很悲伤… ——《你一生的故事》",
        "你是我不可言喻的欢喜，我是你若有若无的归期。——《你一生的故事》",
        "有时候我希望你的一生能被拍成一部漫长的电影。 然后让我比你晚出生一百年，一辈子只做一件事。 独自坐在房间里，对着墙上的荧幕光影，用我的一生，把你的一生慢慢看完。——《你一生的故事》",
        "多谢你如此精彩耀眼 做我平淡岁月里星辰 ——《谢你过我平庸一生》",
        "谢你过我平庸一生，让我想过你陪我朝朝暮暮从日出到黄昏。——《谢你过我平庸一生》",
        "谢你过我平庸一生，我本庸碌孤煞，迟早是你的拖累。所以啊，你我本就是两线相交，短暂接触后，背向而行。如今，只愿你遍历山河，归来仍觉人间值得。——《谢你过我平庸一生》"
      ]
    })
  },

  word3: function () {
    this.setData({
      list: [
        "一个人在去南京的火车上，去看妈妈。单曲循环这首歌，哭得不能自已。越长大老街渐渐成了回忆，而父母也老了。以前总觉得他们像金刚，什么事都可以帮我们抗，简直无所不能，所以肆无忌惮。这次妈妈做手术我真得好害怕，总要亲眼看看才放心。希望妈妈早日康复，一切都好起来。——《老街》",
        "没有觉得他像周杰伦也没有觉得他像陈奕迅，就是他自己 ——《老街》",
        "也许你现在仍然是一个人下班，一个人乘地铁，一个人上楼，一个人吃饭，一个人睡觉，一个人发呆。然而你却能一个人下班，一个人乘地铁，一个人上楼，一个人吃饭，一个人睡觉，一个人发呆。很多人离开另外一个人，就没有自己。而你却一个人，度过了所有。你的孤独，虽败犹荣。——《老街》",
        "副歌的惊艳程度如何？我把它写进我高三的一次作文里 然后老师把这一句抄在了黑板上。——《如果当时》",
        "09年听这首歌，当时我们在网恋，15年又在听这首歌，不过我们中间躺着个可爱又磨人的小丫头 ——《如果当时》",
        "副歌部分简直不能听，不能忍。一出来就要跪。两相映衬之下，我有多幸运那年听到了许嵩。——《如果当时》"
      ]
    })
  },

  word4: function () {
    this.setData({
      list: [
        "突然想到了唐朝的离婚协议： 愿妻娘子相离之后，重梳蝉鬓，美扫娥眉，巧逞窈窕之姿，选聘高官之主，弄影庭前，美效琴瑟合韵之态。解怨释结，更莫相憎;一别两宽，各生欢喜。——《未见青山老》",
        "我见众生皆草木 唯你是青山 ——《未见青山老》",
        "不忍看山顶上那寥落的星子，只因像极了你哀恸的眸。旧人不覆，只一眼，便又坠入轮回的深渊。若有来世，我还想和你相逢，做不了人，便做你一年四季迎面的风，时刻与你相拥。——《未见青山老》",
        "初夏的约定总会如约而至，就像丢失在人群中的你，其实一直就在我身边，所以我们相约老地方，重新认识，你好 ——《如约而至》",
        "那些短暂的相遇，短暂的美好 会不会在心里埋下长久的种子 我越来越相信，用爱来连接着的人 一定会重逢在某个时间、某个地点 某个现在我无法想象的形式 又或许在彼此的脑海和广袤的银河星海里 我们早已经无数次电波冲撞 无数次...喜悦相逢 ——《如约而至》",
        "人生的告别看似偶然却又必经。 最美好的约定是没有约定， 而最好的如约而至，是无约可至。——《如约而至》"
      ]
    })
  },

  word5: function () {
    this.setData({
      list: [
        "女生就应该这么大气，才不要整天你不爱我你不要我。我们要强大到离了谁都能过，但又要charming到离了我你的世界黯然失色 ——《风雨彩虹铿锵玫瑰》",
        "每次自己累了疲惫了，都会听这首歌。自己也跟着唱。风雨彩虹，雨后是晴天。不管遇到什么都要坚强，我相信老天给我把门关上同时也为你开起了一扇窗。。。——《风雨彩虹铿锵玫瑰》",
        "此曲献给为国争光的女排姑娘们，真给国人解气，打的巴西娃娃都哭了！风雨彩虹，铿锵玫瑰，再多忧伤再多痛苦自己去背！为女排加油 ——《风雨彩虹铿锵玫瑰》",
        "像风行了八千里 不问归期 ——《像风一样》",
        "在这个世界只有风，永远让我们捉摸不定 ——《像风一样》",
        "听到前奏眼泪一下就下来了 想起妈妈去世后爸爸有多难过 为他们写的歌《失散》里有一句歌词说：“有些爱 要一生才能忘怀” 谢谢薛之谦的“你竟然能做到带走阳光，你卷起千层海浪我躲也不躲往里闯。——《像风一样》"
      ]
    })
  }
})